results/routeA/initialization_check/A-Ra1e6-fine/0/gh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      gh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
25600
(
-0.04401408450704225
-0.04401408450704226
-0.04401408450704226
-0.04401408450704225
-0.04401408450704224
-0.04401408450704226
-0.04401408450704227
-0.04401408450704225
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-0.04401408450704226
-0.1320422535211268
-0.2200704225352112
-0.3080985915492958
-0.3961267605633804
-0.4841549295774648
-0.5721830985915493
-0.6602112676056339
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-0.04401408450704226
-0.1320422535211268
-0.2200704225352112
-0.3080985915492958
-0.3961267605633803
-0.4841549295774648
-0.5721830985915491
-0.6602112676056338
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-14.08450704225352
-14.08450704225352
-14.08450704225352
-14.08450704225352
-14.08450704225352
-14.08450704225352
-14.08450704225352
-14.08450704225352
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
