results/routeA/initialization_check/A-Ra1e6-fine/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
25600
(
-0.04401408450704226
-0.04401408450704226
-0.04401408450704226
-0.04401408450704226
-0.04401408450704226
-0.04401408450704226
-0.04401408450704226
-0.04401408450704226
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-0.04399207746478873
-0.1319762323943662
-0.2199603873239437
-0.3079445422535211
-0.3959286971830986
-0.483912852112676
-0.5718970070422535
-0.659881161971831
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-0.04403609154929577
-0.1321082746478873
-0.2201804577464789
-0.3082526408450704
-0.396324823943662
-0.4843970070422535
-0.5724691901408451
-0.6605413732394366
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           uniform -14.08450704225352;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
