results/routeA/initialization_check/A-Ra1e6-fine/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
25600
(
-6.938893903907228e-18
0
0
-6.938893903907228e-18
-1.387778780781446e-17
6.938893903907228e-18
1.387778780781446e-17
-6.938893903907228e-18
...
)
;

boundaryField
{
    hotWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
160
(
6.938893903907228e-18
0
-5.551115123125783e-17
5.551115123125783e-17
1.110223024625157e-16
5.551115123125783e-17
0
1.110223024625157e-16
...
)
;
    }
    coldWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
160
(
0
-2.775557561562891e-17
-8.326672684688674e-17
0
0
0
-2.220446049250313e-16
-1.110223024625157e-16
...
)
;
    }
    bottomWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    topWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
160
(
-1.77635683940025e-15
-3.552713678800501e-15
-3.552713678800501e-15
-1.77635683940025e-15
-3.552713678800501e-15
0
0
0
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
