results/routeA/initialization_check/A-Ra1e6-fine/constant/physicalProperties
FoamFile
{
    format ascii;
    class dictionary;
    location "constant";
    object physicalProperties;
}
thermoType
{
    type heRhoThermo;
    mixture pureMixture;
    transport const;
    thermo eConst;
    equationOfState Boussinesq;
    specie specie;
    energy sensibleInternalEnergy;
}
mixture
{
    specie
    {
        molWeight 28.9;
    }
    equationOfState
    {
        rho0 1;
        T0 300;
        beta 1e-3;
    }
    thermodynamics
    {
        Cv 1000;
        hf 0;
    }
    transport
    {
        mu 1e-5;
        Pr 0.71;
    }
}
